import { defaultLogger } from './StringLogger';
import { 音韻地位 } from './音韻地位';

export const 推導廣州音 = (當前音韻地位: 音韻地位): string => {
  const is = (...x: Parameters<typeof 當前音韻地位.屬於>) => 當前音韻地位.屬於(...x);
  const when = (...x: Parameters<typeof 當前音韻地位.判斷>) => 當前音韻地位.判斷(...x);

  // if (!當前音韻地位) return [];

  if (is`云母 通攝 舒聲`) 當前音韻地位 = 當前音韻地位.調整('匣母', ['匣母三等']);

  const 聲母規則 = (): string => {
    const { 聲母, 解釋 } = when(
      [
        ['幫滂並母 C類', { 聲母: 'f', 解釋: '幫滂並母 C類（脣音）推導為聲母 f' }],
        ['幫母', { 聲母: 'b', 解釋: '幫母推導為聲母 b' }],
        ['並母 仄聲', { 聲母: 'b', 解釋: '並母仄聲推導為聲母 b' }],
        ['滂母', { 聲母: 'p', 解釋: '滂母推導為聲母 p' }],
        ['並母 平聲', { 聲母: 'p', 解釋: '並母平聲推導為聲母 p' }],
        ['明母', { 聲母: 'm', 解釋: '明母推導為聲母 m' }],

        ['端母 或 定母 仄聲', { 聲母: 'd', 解釋: '端母或定母仄聲推導為聲母 d' }],
        ['透母 或 定母 平聲', { 聲母: 't', 解釋: '透母或定母平聲推導為聲母 t' }],
        ['泥孃母', { 聲母: 'n', 解釋: '泥孃母推導為聲母 n' }],
        ['來母', { 聲母: 'l', 解釋: '來母推導為聲母 l' }],

        ['精莊知章母 或 從崇俟邪澄母 仄聲', { 聲母: 'z', 解釋: '精莊知章母 或 從崇俟邪澄母 仄聲推導為聲母 z' }], // 精莊組濁音塞擦音多於擦音（下同）
        ['清初徹昌母 或 從崇俟邪澄母 平聲', { 聲母: 'c', 解釋: '清初徹昌母 或 從崇俟邪澄母 平聲推導為聲母 c' }],
        ['心生常書船母', { 聲母: 's', 解釋: '心生常書船母推導為聲母 s' }], // 章組濁音擦音多於塞擦音

        ['見母 或 羣母 仄聲', { 聲母: 'g', 解釋: '見母或羣母仄聲推導為聲母 g' }],
        ['羣母 平聲', { 聲母: 'k', 解釋: '羣母平聲推導為聲母 k' }],
        ['疑母', { 聲母: 'ng', 解釋: '疑母推導為聲母 ng' }], // 細音為 j，詳後

        ['溪曉母', { 聲母: 'h', 解釋: '溪曉母推導為聲母 h' }], // 溪母多數擦化；三四等拼 a 元音部分韻母時為 j/w，詳後
        [
          '匣母',
          [
            ['合口 或 (遇攝 一等)', { 聲母: 'j', 解釋: '匣母 合口 或 (遇攝 一等) 推導為聲母 j' }], // 拼展脣或後元音時為 w，詳後
            ['', { 聲母: 'h', 解釋: '匣母 非 合口 或 (遇攝 一等) 推導為聲母 h' }],
          ],
        ],
        [
          '影云以日母',
          [
            ['三四等', { 聲母: 'j', 解釋: '影云以日母三四等推導為聲母 j' }], // 拼展脣或後元音時為 w，詳後
            ['', { 聲母: '', 解釋: '影云以日母非三四等推導為零聲母' }],
          ],
        ],
      ],
      '無聲母規則',
    ) as { 聲母: string; 解釋: string };
    defaultLogger.log(解釋);
    return 聲母;
  };

  function 韻母規則(): string {
    return when(
      [
        ['通攝', 'ung'],

        [
          '止攝',
          [
            ['脣音', 'ei'],
            ['開口 (端組 或 孃來母 或 見溪羣曉母)', 'ei'],
            ['開口', 'i'],
            ['合口 舌齒音', 'eoi'],
            ['合口 牙喉音', 'ai'],
          ],
        ],

        [
          '遇攝',
          [
            [
              '三四等',
              [
                ['幫滂並母', 'u'],
                ['明母', 'ou'],
                ['莊組', 'o'],
                ['端精組 或 孃來母 或 見溪羣曉母', 'eoi'],
                ['', 'yu'],
              ],
            ],
            [
              '一等',
              [
                ['脣音 或 舌齒音', 'ou'],
                ['疑母', ''],
                ['牙喉音', 'u'],
              ],
            ],
          ],
        ],

        [
          '蟹攝',
          [
            ['廢韻 平上聲 章組', 'oi'], // 參照「茝」coi2
            ['合口 銳音', 'eoi'], // 含以母
            ['三四等', 'ai'],
            ['二等 或 泰韻 開口 (端組 或 來母)', 'aai'],
            [
              '一等',
              [
                ['開口 或 疑母', 'oi'],
                ['', 'ui'],
              ],
            ],
          ],
        ],

        [
          '臻攝',
          [
            [
              '三四等',
              [
                ['合口 舌齒音', 'eon'],
                ['', 'an'],
              ],
            ],
            [
              '一等',
              [
                ['脣音', 'un'],
                ['合口 (端組 或 來母)', 'eon'],
                ['合口 精組', 'yun'],
                ['', 'an'],
              ],
            ],
          ],
        ],

        [
          '山攝',
          [
            ['二等 或 脣音 C類', 'aan'],
            [
              '三四等',
              [
                ['開口 或 脣音', 'in'],
                ['合口', 'yun'],
              ],
            ],
            [
              '一等',
              [
                ['開口 舌齒音', 'aan'],
                ['開口 牙喉音', 'on'],
                ['合口 舌齒音', 'yun'],
                ['合口 牙喉音 或 脣音', 'un'],
              ],
            ],
          ],
        ],

        [
          '效攝',
          [
            ['三四等', 'iu'],
            ['二等', 'aau'],
            ['一等', 'ou'],
          ],
        ],

        [
          '果假攝',
          [
            [
              '三四等',
              [
                ['脣音 C類', 'o'],
                ['開口 或 脣音', 'e'],
                ['合口', 'oe'],
              ],
            ],
            ['二等', 'aa'],
            ['一等', 'o'],
          ],
        ],

        [
          '宕江攝',
          [
            [
              '三四等',
              [
                ['脣音 C類 或 開口 莊組 或 合口', 'ong'],
                ['', 'oeng'],
              ],
            ],
            ['二等 舌齒音', 'oeng'],
            ['一二等', 'ong'],
          ],
        ],

        [
          '梗曾攝',
          [
            [
              '一二等 或 梗攝 莊組',
              [
                // 文 ang、白 aang，兩者勢均，推導音依文讀
                ['庚韻 二等 (來母 或 端組)', 'aang'], // 唯來母「冷」向無 lang 音例，故例外，端組亦從之
                ['', 'ang'],
              ],
            ],
            ['三四等', 'ing'],
          ],
        ],

        [
          '流攝',
          [
            ['四等 端組 或 幽韻 幫滂並母', 'iu'], // 「丟」「彪」「淲」
            ['', 'au'],
          ],
        ],

        ['深攝', 'am'], // -m 拼脣音時為 -n，詳後，下同

        [
          '咸攝',
          [
            ['二等 或 脣音 C類', 'aam'],
            ['三四等', 'im'],
            ['一等 脣舌齒音', 'aam'], // 脣音僅僻字，如「姏」maan4
            ['一等 牙喉音', 'om'], // -om 併入 -am，但影響陰入分化，詳後
          ],
        ],
      ],
      '無韻母規則',
    ) as string;
  }

  const 聲調規則 = (): string => {
    const { 聲調, 解釋 } = when(
      [
        [
          '清音',
          [
            ['平聲', { 聲調: '1', 解釋: '清音平聲推導為第 1 聲（陰平）' }],
            ['上聲', { 聲調: '2', 解釋: '清音上聲推導為第 2 聲（陰上）' }],
            ['去聲', { 聲調: '3', 解釋: '清音去聲推導為第 3 聲（陰去）' }],
            ['入聲', { 聲調: '3', 解釋: '清音入聲推導為第 3 聲（下陰入）' }], // 中入於短元音為 1（陰入），詳後
          ],
        ],
        [
          '濁音',
          [
            ['平聲', { 聲調: '4', 解釋: '濁音平聲推導為第 4 聲（陽平）' }],
            ['上聲 次濁', { 聲調: '5', 解釋: '次濁上聲推導為第 5 聲（陽上）' }],
            ['上聲 全濁', { 聲調: '6', 解釋: '全濁上聲推導為第 6 聲（陽去）' }],
            ['去聲', { 聲調: '6', 解釋: '濁音去聲推導為第 6 聲（陽去）' }],
            ['入聲', { 聲調: '6', 解釋: '濁音入聲推導為第 6 聲（陽入）' }],
          ],
        ],
      ],
      '無聲調規則',
    ) as { 聲調: string; 解釋: string };
    defaultLogger.log(解釋);
    return 聲調;
  };

  const is短元音 = (韻母: string): boolean => {
    if (['am', 'an', 'ang', 'eon', 'ing', 'ung'].includes(韻母)) return true;
    if (['aam', 'aan', 'im', 'in', 'om', 'on', 'ong', 'oeng', 'un', 'yun'].includes(韻母)) return false;
    throw new Error('無長短元音規則：' + 韻母);
  };

  let 聲母 = 聲母規則();
  let 韻母 = 韻母規則();
  let 聲調 = 聲調規則();

  // ng 拼細音時為 j
  const is細音 = ['eo', 'i', 'oe', 'u', 'yu'].some(x => 韻母.startsWith(x));
  if (聲母 === 'ng' && is細音) 聲母 = 'j';

  // 三四等清調 h 拼 a 元音部分韻母時為 j/w
  if (聲母 === 'h' && ['au', 'an', 'am'].includes(韻母) && is`清音 三四等 非 (臻攝 開口 入聲) 非 (臻攝 合口 舒聲)`) {
    聲母 = 'j';
  }

  // 陰入分化
  if (is`入聲` && 聲調 === '3' && is短元音(韻母)) {
    聲調 = '1';
    defaultLogger.log(`廣州音韻母 ${韻母} 為短元音韻母，因此第 3 聲（下陰入）需改為第 1 聲（上陰入）`);
  }

  // 合口
  if (is`合口 或 模韻` && !['eo', 'oe', 'yu'].some(x => 韻母.startsWith(x))) {
    if ((聲母 === 'g' || 聲母 === 'k') && !韻母.startsWith('u')) 聲母 += 'w';
    else if (聲母 === 'h' && !韻母.startsWith('i')) 聲母 = 'f';
    else if (聲母 === 'j' || 聲母 === '') 聲母 = 'w';
  }

  // -om 併入 -am
  if (韻母 === 'om') 韻母 = 'am';

  // m 韻尾在聲母為脣音時為 n
  if (is`脣音` && 韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'n';

  if (is`入聲`) {
    const 韻母old = 韻母;
    if (韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'p';
    else if (韻母.endsWith('n')) 韻母 = 韻母.slice(0, -1) + 't';
    else if (韻母.endsWith('ng')) 韻母 = 韻母.slice(0, -2) + 'k';
    defaultLogger.log(`將舒聲韻母 ${韻母old} 改為對應的入聲韻母 ${韻母}`);
  }

  const 結果 = 聲母 + 韻母 + 聲調;
  defaultLogger.log(`因此，音韻地位「${當前音韻地位.描述}」對應的廣州音為 ${結果}`);
  return 結果;
};
