/** 全部六要素之枚舉 */
export const 所有 = {
  母: new Set('幫滂並明端透定泥來知徹澄孃精清從心邪莊初崇生俟章昌常書船日見溪羣疑影曉匣云以'),
  呼: new Set('開合'),
  等: new Set('一二三四'),
  類: new Set('ABC'),
  韻: new Set('東冬鍾江支脂之微魚虞模齊祭泰佳皆夬灰咍廢真臻文殷元魂痕寒刪山先仙蕭宵肴豪歌麻陽唐庚耕清青蒸登尤侯幽侵覃談鹽添咸銜嚴凡'),
  聲: new Set('平上去入'),
} as const;

/** 幫見影組聲母，在三等分ABC類 */
export const 鈍音母 = new Set('幫滂並明見溪羣疑影曉匣云');

export const 陰聲韻 = new Set('支脂之微魚虞模齊祭泰佳皆夬灰咍廢蕭宵肴豪歌麻侯尤幽');

/** 依可搭配的等列出各韻 */
export const 等韻搭配 = {
  一: new Set('冬模泰灰咍魂痕寒豪唐登侯覃談'),
  二: new Set('江佳皆夬刪山肴耕咸銜'),
  三: new Set('鍾支脂之微魚虞祭廢真臻文殷元仙宵陽清蒸尤幽侵鹽嚴凡'),
  四: new Set('齊先蕭青添'),
  一三: new Set('東歌'),
  二三: new Set('麻庚'),
} as const;

/** 依可搭配的呼列出各韻 */
export const 呼韻搭配 = {
  開合: new Set('支脂微齊祭泰佳皆夬廢真元寒刪山先仙歌麻陽唐庚耕清青蒸登'),
  開: new Set('之魚咍臻殷痕蕭宵肴豪幽侵覃談鹽添咸銜嚴'),
  合: new Set('虞灰文魂凡'),
  中立: new Set('東冬鍾江模尤侯'),
} as const;

/** 依可搭配的等列出各母，包含邊緣搭配 */
export const 等母搭配 = {
  一二三四: new Set('幫滂並明來見溪羣疑影曉匣'),
  二三: new Set('知徹澄孃莊初崇生俟'),
  一三四: new Set('精清從心邪'),
  三: new Set('章昌常書船日云以'),
  一二四: new Set('端透定泥'),
} as const;
