import test from 'ava';

import { decode, iter音韻地位, 音韻地位 } from './音韻地位';

// 由音韻地位得出各項音韻屬性

test('測試「法」字對應的音韻地位的各項音韻屬性', (t) => {
  const 當前音韻地位 = new 音韻地位('幫', null, '三', null, '凡', '入');

  // 基本音韻屬性（六個）
  t.is(當前音韻地位.母, '幫');
  t.is(當前音韻地位.呼, null);
  t.is(當前音韻地位.等, '三');
  t.is(當前音韻地位.重紐, null);
  t.is(當前音韻地位.韻, '凡');
  t.is(當前音韻地位.聲, '入');

  // 拓展音韻屬性
  t.is(當前音韻地位.清濁, '全清');
  t.is(當前音韻地位.音, '脣');
  t.is(當前音韻地位.攝, '咸');

  // 其他
  t.is(當前音韻地位.描述, '幫三凡入');
  t.is(當前音韻地位.表達式, '幫母 三等 凡韻 入聲');
  t.is(當前音韻地位.編碼, 'A5T');
  t.is(當前音韻地位.代表字, '法');
});

test('測試「祇」字對應的音韻地位的各項音韻屬性', (t) => {
  const 當前音韻地位 = new 音韻地位('羣', '開', '三', 'A', '支', '平');

  // 基本音韻屬性（六個）
  t.is(當前音韻地位.母, '羣');
  t.is(當前音韻地位.呼, '開');
  t.is(當前音韻地位.等, '三');
  t.is(當前音韻地位.重紐, 'A');
  t.is(當前音韻地位.韻, '支');
  t.is(當前音韻地位.聲, '平');

  // 拓展音韻屬性
  t.is(當前音韻地位.清濁, '全濁');
  t.is(當前音韻地位.音, '牙');
  t.is(當前音韻地位.攝, '止');

  // 其他
  t.is(當前音韻地位.描述, '羣開三A支平');
  t.is(當前音韻地位.表達式, '羣母 開口 三等 重紐A類 支韻 平聲');
  t.is(當前音韻地位.編碼, 'fEQ');
  t.is(當前音韻地位.代表字, '祇');
});

test('查詢有音無字的音韻地位', (t) => {
  const 當前音韻地位 = new 音韻地位('從', '合', '三', null, '歌', '平');

  t.is(當前音韻地位.代表字, null);
  t.is(當前音韻地位.反切(null), null);
});

// 屬於

test('測試「法」字對應的音韻地位的屬於函式', (t) => {
  const 當前音韻地位 = new 音韻地位('幫', null, '三', null, '凡', '入');
  t.true(當前音韻地位.屬於('幫母'));
  t.true(當前音韻地位.屬於('幫精組'));
  t.false(當前音韻地位.屬於('精組'));
  t.false(當前音韻地位.屬於('重紐A類 或 重紐B類'));
  t.false(當前音韻地位.屬於('喉音'));
  t.true(當前音韻地位.屬於('仄聲'));
  t.false(當前音韻地位.屬於('舒聲'));
  t.false(當前音韻地位.屬於('次濁'));
});

// 遍歷所有音韻地位

test('遍歷所有音韻地位', (t) => {
  for (const 當前音韻地位 of iter音韻地位()) {
    t.true(decode(當前音韻地位.編碼).等於(當前音韻地位));
    t.true(當前音韻地位.屬於(當前音韻地位.表達式));
  }
});

// 音韻編碼

test('測試不合法音韻地位', (t) => {
  t.throws(() => new 音韻地位('從', '合', '三', 'A', '歌', '平'));
});
