/** 全部六要素之枚舉 */
export const 所有 = {
  母: [...'幫滂並明端透定泥來知徹澄孃精清從心邪莊初崇生俟章昌常書船日見溪羣疑影曉匣云以'],
  呼: [...'開合'],
  等: [...'一二三四'],
  類: [...'ABC'],
  韻: [...'東冬鍾江支脂之微魚虞模齊祭泰佳皆夬灰咍廢真臻文殷元魂痕寒刪山先仙蕭宵肴豪歌麻陽唐庚耕清青蒸登尤侯幽侵覃談鹽添咸銜嚴凡'],
  聲: [...'平上去入'],
} as const;

/** 幫見影組聲母，在三等分ABC類 */
export const 鈍音母 = [...'幫滂並明見溪羣疑影曉匣云'] as const;

/** 依可搭配的等列出各韻 */
export const 等韻搭配 = {
  一: [...'冬模泰咍灰痕魂寒豪唐登侯覃談'],
  二: [...'江佳皆夬刪山肴耕咸銜'],
  三: [...'鍾支脂之微魚虞祭廢真臻殷元文仙宵陽清蒸尤幽侵鹽嚴凡'],
  四: [...'齊先蕭青添'],
  一三: [...'東歌'],
  二三: [...'麻庚'],
} as const;

/** 依可搭配的呼列出各韻 */
export const 呼韻搭配 = {
  開合: [...'支脂微齊祭泰佳皆夬廢真元寒刪山先仙歌麻陽唐庚耕清青蒸登'],
  開: [...'之魚咍臻殷痕蕭宵肴豪幽侵覃談鹽添嚴咸銜'],
  合: [...'虞灰魂文凡'],
  中立: [...'東冬鍾江模尤侯'],
} as const;

/**
 * 依可搭配的類列出各韻。其中：
 * - `C` 列出的韻為非前元音
 * - `AB`、`A`、`B` 列出的韻為前元音
 * - `CB` 僅蒸韻
 * - `CA` 僅陽韻
 * */
export const 類韻搭配 = {
  C: [...'東鍾之微魚虞廢殷元文歌尤嚴凡'],
  AB: [...'支脂祭真仙宵幽侵鹽'],
  A: [...'麻清'],
  B: [...'庚'],
  CB: [...'蒸'],
  CA: [...'陽'],
} as const;

/** 依可搭配的等列出各母，包含邊緣搭配 */
export const 等母搭配 = {
  一二三四: [...'幫滂並明端透定泥來見溪羣疑影曉'],
  二三: [...'知徹澄孃莊初崇生俟'],
  一三四: [...'精清從心邪'],
  三: [...'章昌常書船日云以'],
  一二四: [...'匣'],
} as const;
