/** 全部六要素之枚舉 */
export const 所有 = {
  母: [...'幫滂並明端透定泥來知徹澄孃精清從心邪莊初崇生俟章昌常書船日見溪羣疑影曉匣云以'],
  呼: [...'開合'],
  等: [...'一二三四'],
  重紐: [...'AB'],
  韻: [...'東冬鍾江支脂之微魚虞模齊祭泰佳皆夬灰咍廢真臻文殷元魂痕寒刪山先仙蕭宵肴豪歌麻陽唐庚耕清青蒸登尤侯幽侵覃談鹽添咸銜嚴凡'],
  聲: [...'平上去入'],
} as const;

/** 依等列出各韻 */
export const 各等韻 = {
  一: [...'冬模泰咍灰痕魂寒豪唐登侯覃談'],
  二: [...'江佳皆夬刪山肴耕咸銜'],
  三: [...'鍾支脂之微魚虞祭廢真臻殷元文仙宵陽清蒸尤幽侵鹽嚴凡'],
  四: [...'齊先蕭青添'],
  一三: [...'東歌'],
  二三: [...'麻庚'],
} as const;

export const 呼韻搭配 = {
  開合: [...'支脂微齊祭泰佳皆夬廢真元寒刪山先仙歌麻陽唐庚耕清青蒸登'],
  開: [...'之魚咍臻殷痕蕭宵肴豪幽侵覃談鹽添嚴咸銜'],
  合: [...'虞灰魂文凡'],
  中立: [...'東冬鍾江模尤侯'],
} as const;

export const 陰聲韻 = [...'支脂之微魚虞模齊祭泰佳皆夬灰咍廢蕭宵肴豪歌麻侯尤幽'] as const;

export const 重紐八韻 = [...'支脂祭真仙宵侵鹽'] as const;
/** 重紐八韻及庚、清，必須標重紐 */
export const 可靠重紐韻 = [...重紐八韻, ...'庚清'] as const;
/** 重紐八韻及庚、清、蒸、幽 */
export const 重紐韻 = [...可靠重紐韻, ...'蒸幽'] as const;

export const 前元音三等韻 = [...'支脂祭真仙宵麻庚清幽侵鹽'] as const;
export const 非前元音三等韻 = [...'東鍾之微魚虞廢殷元文歌陽尤鹽嚴凡'] as const;

export const 鈍音母 = [...'幫滂並明見溪羣疑影曉匣云'] as const;
