export const 韻到攝 = {
  東: '通', 冬: '通', 鍾: '通',
  江: '江',
  支: '止', 脂: '止', 之: '止', 微: '止',
  魚: '遇', 虞: '遇', 模: '遇',
  齊: '蟹', 佳: '蟹', 皆: '蟹', 灰: '蟹', 咍: '蟹', 祭: '蟹', 泰: '蟹', 夬: '蟹', 廢: '蟹',
  眞: '臻', 諄: '臻', 臻: '臻', 文: '臻', 欣: '臻', 元: '臻', 魂: '臻', 痕: '臻',
  寒: '山', 桓: '山', 刪: '山', 山: '山', 先: '山', 仙: '山',
  蕭: '效', 宵: '效', 肴: '效', 豪: '效',
  歌: '果', 戈: '果',
  麻: '假',
  唐: '宕', 陽: '宕',
  庚: '梗', 耕: '梗', 清: '梗', 青: '梗',
  登: '曾', 蒸: '曾',
  侯: '流', 尤: '流', 幽: '流',
  侵: '深',
  覃: '咸', 談: '咸', 鹽: '咸', 添: '咸', 咸: '咸', 銜: '咸', 嚴: '咸', 凡: '咸',
};

export const 組到母 = {
  幫: ['幫', '滂', '並', '明'],
  端: ['端', '透', '定', '泥'],
  知: ['知', '徹', '澄', '孃'],
  精: ['精', '清', '從', '心', '邪'],
  莊: ['莊', '初', '崇', '生', '俟'],
  章: ['章', '昌', '船', '書', '常'],
  見: ['見', '溪', '羣', '疑'],
  影: ['影', '曉', '匣', '云'],
};
